;Да се напише функция quadrant, която приема 2 аргумента - координати на точка и връща номера на квадранта (спрямо стандартна координатна система), в който тази точка лежи.
(define (quadrant x y)
  (cond
    ((and (= x 0) (= y 0)) 0)
    ((and (> x 0) (> y 0)) 1)
    ((and (< x 0) (> y 0)) 2)
    ((and (< x 0) (< y 0)) 3)
    ((and (> x 0) (< y 0)) 4)
  )
)

;Да се напише предикат circle?, който приема 3 аргумента - координати на точка и радиус на окръжност и връща дали точката със зададените 
;координати лежи във вътрешността или по контура на окръжносттта с център началото на координатната система и зададения като аргумент радиус.
(define (circle x y radius)
   (<= (+ (* x x) (* y y)) (* radius radius))
)

;Да се напише функция area, която приема 3 аргумента - дължини на страни на триъгълник и връща лицето на триъгълника пресметнато 
;чрез формулата на Херон. Няма нужда да се прави валидация на входа (дали съществува триъгълник с такива страни).
(define (area a b c)
  (define (p) (/ (+ a b c) 2))
  (sqrt (* (p) (- (p) a) (- (p) b) (- (p) c)))
)